{"task_name": "reconstruction", 
"model_name": "MOMENT", 
"transformer_type": "encoder_only", 
"d_model": null, 
"seq_len": 512, 
"patch_len": 8, 
"patch_stride_len": 8, 
"device": "cpu", 
"transformer_backbone": "google/flan-t5-base", 
"model_kwargs": {},
"t5_config": {
    "architectures": [
      "T5ForConditionalGeneration"
    ],
    "d_ff": 2048,
    "d_kv": 64,
    "d_model": 768,
    "decoder_start_token_id": 0,
    "dropout_rate": 0.1,
    "eos_token_id": 1,
    "feed_forward_proj": "gated-gelu",
    "initializer_factor": 1.0,
    "is_encoder_decoder": true,
    "layer_norm_epsilon": 1e-06,
    "model_type": "t5",
    "n_positions": 512,
    "num_decoder_layers": 12,
    "num_heads": 12,
    "num_layers": 12,
    "output_past": true,
    "pad_token_id": 0,
    "relative_attention_max_distance": 128,
    "relative_attention_num_buckets": 32,
    "tie_word_embeddings": false,
    "use_cache": true,
    "vocab_size": 32128
  }
}
